##################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

##################################################################################################################




##################################################################################################################

#선형 판별 분석은 MASS 패키지로 수행 가능.
#biopsy 데이터에 접근 가능.
#문법은 lm() 및 glm() 함수와 매우 유사.

library(InformationValue)
library(bestglm)

library(MASS)

lda.fit <- lda(class ~ ., data = train )
lda.fit

##################################################################################################################

#출력물을 보면 prior probabilities of groups(그룹별 사전 확률)이 양성(benign)은 약 64%, 악성(malign)은 36%를 차지함.
#클래스 별로 각 피처들의 평균값을 나타냄. 선형 판별 계수(Coefficient of Linear Discriminant)는 표준화한(standardized)피처들의 선형결합
#이값은  관찰값의 판별 점수를 계산하는데 쓰임.판별점수가 높을수록 악성(malignant)쪽으로 분류됨.

##################################################################################################################

#선형 판별 분석에서 plot()함수는 히스토그램과 판별 점수의 밀도를 그림
#그림에서 두 그룹 사이에 약간 겹치는 부분은 올바르지 않게 분류된 관찰값이 존재함을 가리킴.
plot(lda.fit, type = "both")

#이차 판별 분석과 함께 predict()함수를 쓸 수 있는데, class(클래스), posterior(사후확률), x 등, 3가지 요소를 리스트로 제공
#클래스 요소는 양성과 악성의 예측, 사후 확률은 x가 각 클래스에 속활 확률 점수 그리고 x는 선형 판별 점수를 나타냄.
#관찰값이 악성일 확률을 추출.

train.lda.prob <- predict(lda.fit)$posterior[, 2]
misClassError(trainY, train.lda.prob)
confusionMatrix(trainY, train.lda.prob)

#실행한 이차 판별 분석 모형이 로지스틱 회귀 모형보다 성능 좋지 않게 나타남.
#그러면 test 데이터에 관해서는 성능이 어떨까?라는 질문을 할 수 있음.

##################################################################################################################

test.lda.prob <- predict(lda.fit, newdata = test)$posterior[, 2]
misClassError(testY, test.lda.prob)

confusionMatrix(testY, test.lda.prob)

#훈련데이터로 성능이 나빴던 걸 생각하면, test 데이터에서는 예상보다 그리 나쁜 성과는 아님.
#올바르게 분류했는지의 관점에서 보면, 로지스틱 회귀만큼 성능이 좋지는 않음
#(선형판별 분석 96%, 로지스틱회귀의 분류는 98%를 기록)

##################################################################################################################

###이차판별분석
##MASS package의 qda()함수로 실행.

qda.fit <- qda(class ~ ., data = train)
qda.fit

#이차판별분석에서와 마찬가지로, 출력물은 Group means(그룹 평균)은 보여주지만, 앞서 논했던 것처럼 이차함수이기에 피처들의 계수는 없음.
#훈련데이터와 테스트 데이터에 관한 에측은 다음 코드처럼 이차판별분석에서와 같은 흐름을 따름.

##################################################################################################################

train.qda.prob <- predict(qda.fit)$posterior[, 2]
misClassError(trainY, train.qda.prob)

confusionMatrix(trainY, train.qda.prob)

test.qda.prob <- predict(qda.fit, newdata = test)$posterior[, 2]
misClassError(testY, test.qda.prob)

confusionMatrix(testY, test.qda.prob)

#혼동행렬을 확인하면, 이차 판별 분석 데이터에 관한 예측이 가장 나쁘며, 테스트 세트에 관해서도 11개의 틀린 예측을 낳아 성능이 나빠짐.
#회위양성이 높은 비율로 나타남.