######################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github statistics package에 issue를 남기면 확인

######################################################################################################################################





######################################################################################################################################

# 범주형 변수 간의 관련성은 x^2검정(chi-square test)을 통해 확인할 수 있음.
# x^2 검정은 교차표상의 응답빈도를 바탕으로 수행됨.

# 예를 들어서, 안전벨트 착용과 승객 안전 간의 관계에 관심이 있다고 하였을 때 우선 두 변수 간의 교차표 생성.
# 교통사고 환자의 안전벨트 착용 유무와 환자의 상태를 조사하여 교차표를 얻음.

# 이를 이용해서 안전벨트 착용과 안전 간의 관련성을 분석.

######################################################################################################################################


survivors<- matrix(c(1443, 151, 47, 1781, 312, 135), ncol = 2)
dimnames(survivors) <- list("Status"=c("minor injury", "serious injury", "dead"),
                            "Seatbelt"=c("With Seatbelt", "Without Seatbelt"))

survivors

########################################################결과값(print)################################################################

# > survivors<- matrix(c(1443, 151, 47, 1781, 312, 135), ncol = 2)
# > survivors<- matrix(c(1443, 151, 47, 1781, 312, 135), ncol = 2)
# > dimnames(survivors) <- list("Status"=c("minor injury", "serious injury", "dead"),
#                              +                             "Seatbelt"=c("With Seatbelt", "Without Seatbelt"))
# > 
#  > survivors
# Seatbelt
# Status           With Seatbelt Without Seatbelt
# minor injury            1443             1781
# serious injury           151              312
# dead                      47              135

#####################################################################################################################################

# 두 변수 간의 관계를 보다 잘 파악하기 위해 우선 교차표에 행과 열의 합을 추가함.
# 그리고 열이 100% 척도 조정된 열의 비율도 계산.

addmargins(survivors)


addmargins(prop.table(addmargins(survivors, 2), 2), 1)



########################################################결과값(print)################################################################

# > addmargins(survivors)
# Seatbelt
# Status           With Seatbelt Without Seatbelt  Sum
# minor injury            1443             1781 3224
# serious injury           151              312  463
# dead                      47              135  182
# Sum                     1641             2228 3869
# > 
#  > 

#  > addmargins(prop.table(addmargins(survivors, 2), 2), 1)
# Seatbelt
# Status           With Seatbelt Without Seatbelt        Sum
# minor injury      0.87934186       0.79937163 0.83329026
# serious injury    0.09201706       0.14003591 0.11966917
# dead              0.02864107       0.06059246 0.04704058
# Sum               1.00000000       1.00000000 1.00000000



#####################################################################################################################################

# 총 3,869명 안전벨트 착용자는 1,641명이고, 미착용자는 2,228명

# 안전벨트 착용자 가운데 경상자(minor injury)는 1,143명 (비율은 87.9%)
# 안전벨트 미착용자 가운데 경상자는 1,781명 (비율로는 79.9%)

# 안전벨트 착용자의 경상자 비율이 미착용자의 경상자 비율보다 더 높음.
# 반면에 사망자의 경우에는 안전벨트 착용자의 비율이 미착용자보다 더 낮음.

# 중상자(serious injury)의 비율 또한 안전벨트 착용자와 미착용자 간에 차이가 있음을 보여줌.
# 이러한 수치는 안전벨트의 착용이 승객의 안전과 관련이 있음을 보여줌.

# 안전벨트 착용과 안전 간의 관계를 막대도표(barplot()함수)를 이용하여 그래프로 나타냄.

barplot(survivors, ylim = c(0, 2500), las=1,
        col = c("yellowgreen", "lightsalmon", "orangered"),
        ylab = "Frequency", main = "Frequency of Survivors")

legend(0.2, 2500, rownames(survivors),
       fill=c("yellowgreen", "lightsalmon","orangered"))

survivors.prop <- prop.table(survivors, 2)
barplot(survivors.prop*100, las=1, col = c("yellowgreen", "lightsalmon", "orangered"), 
                                           ylab= "Percent", main="Percent of Survivors")

# 왼쪽 막대도표는 빈도로 나타낸 것이고, 오른쪽 막대도표는 빈도를 100%로 척도 조정하여 비율로 나타낸 것.
# 비율의 막대도표를 보면 경상자, 중상자, 사망자의 비율이 안전벨트 착용자와 미착용자간에 분명한 차이가 있음.
# 따라서 안전벨트 착용은 승객의 안전과 밀접한 관련이 있음을 알 수 있음.

#####################################################################################################################################

pchisq(45.91, df=2, lower.tail = FALSE)

# pchisq() 함수를 이용하여 특정 x^2 값에 대응되는 유의확률을 구할 수 있음. 
# x^2 값 45.91(자유도 2)에 대응되는 유의확률은 다음과 같이 매우 작으므로 유의수준 0.05에서 안전벨트 착용 집단과 미착용 집단 간에
# 환자 상태에 있어서 차이가 없다는 귀무가설 기각할 수 있음.


qchisq(0.05, df = 2, lower.tail = FALSE)

# qchisq() 함수는 특정확률에 대응되는 x^2값을 산출. 유의수준 0.05(자유도 2)에 대응되는 x^2값은 다음과 같이 5.99이고 관측된 x^2값은
# 45.91이므로 유의수준 0.05에서 귀무가설을 기각.

########################################################결과값(print)################################################################

# > pchisq(45.91, df=2, lower.tail = FALSE)
# [1] 1.073421e-10

# > qchisq(0.05, df = 2, lower.tail = FALSE)
# [1] 5.991465


#####################################################################################################################################
