############################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github statistics package에 issue를 남기면 확인

############################################################################################################################################



############################################################################################################################################

str(Titanic)

Titanic

# 데이터셋은 다음과 같이 4개의 차원 (Class, Sex, Age, Survived)로 구성되어 있음.

############################################################결과값(print)###################################################################

# > str(Titanic)
# 'table' num [1:4, 1:2, 1:2, 1:2] 0 0 35 0 0 0 17 0 118 154 ...
# - attr(*, "dimnames")=List of 4
# ..$ Class   : chr [1:4] "1st" "2nd" "3rd" "Crew"
# ..$ Sex     : chr [1:2] "Male" "Female"
# ..$ Age     : chr [1:2] "Child" "Adult"
# ..$ Survived: chr [1:2] "No" "Yes"

# > Titanic
# , , Age = Child, Survived = No

# Sex
# Class  Male Female
# 1st     0      0
# 2nd     0      0
# 3rd    35     17
# Crew    0      0

# , , Age = Adult, Survived = No

# Sex
# Class  Male Female
# 1st   118      4
# 2nd   154     13
# 3rd   387     89
# Crew  670      3

# , , Age = Child, Survived = Yes

# Sex
# Class  Male Female
# 1st     5      1
# 2nd    11     13
# 3rd    13     14
# Crew    0      0

# , , Age = Adult, Survived = Yes

# Sex
# Class  Male Female
# 1st    57    140
# 2nd    14     80
# 3rd    75     76
# Crew  192     20

############################################################################################################################################

Titanic.margin <- margin.table(Titanic, margin = c(4,1))
Titanic.margin

# 타이타닉호 탑승객의 승객 구분(1등실, 2등실, 3등실, 승무원)에 따라 생존율에 있어서 차이가 있는지 검정.
# 다차원의 table 객체에 저장된 데이터셋을 이용하여 독립성 검정을 하기 위해서는 먼저 검정하고자 하는 변수로 이루어진 2차원 형태의
# 교차표로 데이터를 변환해야함.

# 이를 위해 우선 margin.table()함수를 이용하여 승객 구분과 생존 여부 간 교차표 작성에 필요한 두 개의 차원만 추출하여 별도의 table 객체로 저장.

# margin.table() 함수는 인수(margin)로 지정된 차원으로 구성된 새로운 요약 테이블을 생성. 
# 다음과 같이 4번째 차원(Survived)과 첫 번째 차원(Class)으로 이루어진 교차표를 생성할 수 있음.

########################################################결과값(print)#######################################################################

# > Titanic.margin <- margin.table(Titanic, margin = c(4,1))
# > Titanic.margin
# Class
# Survived 1st 2nd 3rd Crew
# No  122 167 528  673
# Yes 203 118 178  212


############################################################################################################################################

# 교차표에 행과 열의 합을 추가해보고 열의 비율을 계산.

addmargins(Titanic.margin)

addmargins(prop.table(addmargins(Titanic.margin, 2), 2), 1)

# 1등실(1st)의 승객은 62.5%가 생존한 반면, 3등실(3rd)의 승객은 25.2%만 생존하였음.
# 가장 낮은 생존율을 보인 사람들은 승무원이였음(24.0%).

# 승객 구분에 따라 생존율에 있어서 차이가 있어 보임.
# 독립성검정을 이용하여 이를 통계적으로 수행 가능.

########################################################결과값(print)#######################################################################

# > addmargins(Titanic.margin)
# Class
# Survived  1st  2nd  3rd Crew  Sum
# No   122  167  528  673 1490
# Yes  203  118  178  212  711
# Sum  325  285  706  885 2201


# > addmargins(prop.table(addmargins(Titanic.margin, 2), 2), 1)
# Class
# Survived       1st       2nd       3rd      Crew       Sum
# No  0.3753846 0.5859649 0.7478754 0.7604520 0.6769650
# Yes 0.6246154 0.4140351 0.2521246 0.2395480 0.3230350
# Sum 1.0000000 1.0000000 1.0000000 1.0000000 1.0000000


############################################################################################################################################

# chisq.test()함수를 이용하여 다음과 같이 독립성 수행.

chisq.test(Titanic.margin)

# 검정 결과 p값이 유의수준 0.05에 비해 매우 작으므로 승객 구분과 생존 여부 간에 관계 없다는 귀무가설을 기각할 수 있음.
# 승객 구분에 따라 생존율 차이는 있음.

# 두 범주형 변수 간에 관계가 없다는 귀무가설을 기각하면 이어서 이들 간의 관련성 강도를 평가할 수 있음.

########################################################결과값(print)#######################################################################

# > chisq.test(Titanic.margin)

# Pearson's Chi-squared test

# data:  Titanic.margin
# X-squared = 190.4, df = 3, p-value < 2.2e-16

############################################################################################################################################

# vcd 패키지의 assocstats()함수는 관련성의 강도를 측정하는 지표(Phi-Coefficient, Contingency Coeff, Cramer's V)를 계산.
# 이 지표들은 그 값이 클수록 두 변수간의 관련성이 크다는 것은 나타냄.

library(vcd)
assocstats(Titanic.margin)

########################################################결과값(print)#######################################################################

# > library(vcd)
# 필요한 패키지를 로딩중입니다: grid

# > assocstats(Titanic.margin)
# X^2 df P(> X^2)
# Likelihood Ratio 180.9  3        0
# Pearson          190.4  3        0

# Phi-Coefficient   : NA 
# Contingency Coeff.: 0.282 
# Cramer's V        : 0.294 

############################################################################################################################################

# 범주형 변수 간의 관계는 모자이크 도표(mosaic plot)을 이용하여 시각화 할 수 있음.

# 여기에서는 vcd패키지의 mosaic() 함수를 이용하여 모자이크 도표 생성.

# mosaic() 함수에 다음과 같이 교차표 자체를 지정하거나, 범주형 변수를 포뮬러 형식으로 지정.

library(vcd)
mosaic(Titanic.margin, shade = TRUE, legend=TRUE)
mosaic(~ Survived + Class, data = Titanic.margin, shade=TRUE, legend=TRUE)

############################################################################################################################################


