##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github statistics package에 issue를 남기면 확인

##########################################################################################################################################



##########################################################################################################################################

library(MASS)
str(survey)

# 데이터프레임 형태로 저장된 데이터셋에 대해서는 교차표 생성 과정 없이 검정 대상 변수에 직접 chisq.test() 함수를 적용하여 독립성 검정 수행
# Mass 패키지에 포함된 survey 데이터셋의 Sex 변수와 Fold 변수를 이용하여 독립성 검정 수행.
# Sex 변수는 성별을 나타내며, Fold 변수는 팔짱을 끼었을 때 어느 쪽 손이 위쪽에 위치하는지 나타냄.
# 성별에 따라 팔짱을 끼었을 때의 손위치에 차이가 있는지 검정.

############################################################결과값(print)#################################################################

# > str(survey)
# 'data.frame':	237 obs. of  12 variables:
#  $ Sex   : Factor w/ 2 levels "Female","Male": 1 2 2 2 2 1 2 1 2 2 ...
# $ Wr.Hnd: num  18.5 19.5 18 18.8 20 18 17.7 17 20 18.5 ...
# $ NW.Hnd: num  18 20.5 13.3 18.9 20 17.7 17.7 17.3 19.5 18.5 ...
# $ W.Hnd : Factor w/ 2 levels "Left","Right": 2 1 2 2 2 2 2 2 2 2 ...
# $ Fold  : Factor w/ 3 levels "L on R","Neither",..: 3 3 1 3 2 1 1 3 3 3 ...
# $ Pulse : int  92 104 87 NA 35 64 83 74 72 90 ...
# $ Clap  : Factor w/ 3 levels "Left","Neither",..: 1 1 2 2 3 3 3 3 3 3 ...
# $ Exer  : Factor w/ 3 levels "Freq","None",..: 3 2 2 2 3 3 1 1 3 3 ...
# $ Smoke : Factor w/ 4 levels "Heavy","Never",..: 2 4 3 2 2 2 2 2 2 2 ...
# $ Height: num  173 178 NA 160 165 ...
# $ M.I   : Factor w/ 2 levels "Imperial","Metric": 2 1 NA 2 2 1 1 2 2 2 ...
# $ Age   : num  18.2 17.6 16.9 20.3 23.7 ...


##########################################################################################################################################

with(survey, chisq.test(Fold, Sex))

# chisq.test() 함수에 두 변수를 직접 지정함으로써 독립성검정을 수행할 수 있음.
# 데이터프레임의 두 벡터는 범주형 변수, 즉 factor형이어야 허고, 두 벡터의 원소들은 서로 1대1 대응되도록 저장되어야 함.
# chisq.test() 함수는 내부적으로 교차표를 생성한 후 그 결과를 이용하여 독립성 검정을 수행.

############################################################결과값(print)#################################################################

# > with(survey, chisq.test(Fold, Sex))
#
# Pearson's Chi-squared test
# 
# data:  Fold and Sex
# X-squared = 2.5741, df = 2, p-value = 0.2761

##########################################################################################################################################

crosstab <- with(survey, table(Fold, Sex))
crosstab

chisq.test(crosstab)

# 검정결과를 보면 p값이 유의수준 0.05보다 크므로 성별에 따라 팔짱을 끼었을 때의 손 위치에서 차이가 없다는 귀무가설을 기각못함.
# 따라서 성별과 팔짱을 끼었을 때의 손 위치간에는 관계가 없음. 다음과 같이 교차표를 생성한 후 chisq.test() 함수를 적용.

############################################################결과값(print)#################################################################

# > crosstab <- with(survey, table(Fold, Sex))
# > crosstab
# Sex
# Fold      Female Male
# L on R      48   50
# Neither      6   12
# R on L      64   56


# > chisq.test(crosstab)

# Pearson's Chi-squared test

# data:  crosstab
# X-squared = 2.5741, df = 2, p-value = 0.2761

##########################################################################################################################################
