##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github statistics package에 issue를 남기면 확인

##########################################################################################################################################



##########################################################################################################################################

# 여태까지 두 범주형 변수 간의 독립성 검정하는 방법을 살펴봄.
# 범주형 변수가 하나일 경우에는 범주별 비율 분포에 대한 가설을 검정할 수 있음.

# 소비자단체에서 150명의 휴대전화 사용자를 대상으로 이용하고 있는 이동통신회사를 조사.
# 조사 결과 A회사 이용자는 60명, B회사 이용자는 55명, C회사 이용자는 35명으로 집계.

# 이 데이터를 이용해서 3개 이동통신회사의 시장점유율이 동일한지 검정.

# 관측한 빈도를 토대로 모집단에서의 집단별 비율 분포를 검정하는 것을 적합성검정(goodness of fit test)라고 함.

# 적합성 검정을 위해서는 chisq.test()함수에 집단별 관측빈도와 함께 검정하고자 하는 집단별 비율을 인수로 지정. 
# 검정 비율을 지정하지 않으면 검정 비율은 집단 간에 동일하다고 가정.

# chisq.test()함수에 다음과 같이 관측된 3개의 이동통신회사의 시장점유율(검정하고자 하는 비율)은 동일하다고 가정.

chisq.test(c(60, 55, 35))


# 검정결과의 p값은 유의수준 0.05보다 작으므로 3개의 이동통신회사의 시장점유율이 동일하다는 귀무가설 기각 가능.
# 따라서 3개 이동통신회사의 시장점유율은 동일하다고 볼 수 없음.
 

############################################################결과값(print)#################################################################

# > chisq.test(c(60, 55, 35))
#
# Chi-squared test for given probabilities
#
# data:  c(60, 55, 35)
# X-squared = 7, df = 2, p-value = 0.0302

##########################################################################################################################################

# 시장조사 전문가가 3개 이동통신회사의 시장점유율은 A회사, B회사, C회사 각각 40%, 30%, 25%라고 주장.
# 주장을 검정하면, 검정하고자 하는 검정 비율이 이제 더 이상 집단 간에 동일하지 않기 때문에 검정 비율을 인수로 지정.
# chisq.test() 함수의 p인수 에 다음과 같이 집단별 비율 지정.

oc <- c(60, 55, 35)
null.p <- c(0.45, 0.30, 0.25)
chisq.test(oc, p=null.p)

# 검정 결과를 보면 p값이 유의수준 0.05보다 크기 때문에 귀무가설을 기각할 수 없음.
# 따라서 시장조사 전문가의 주장은 타당하다고 볼 수 있음.

# 소비자 단체에서는 매년 동일한 조사를 수행.
# 작년에 조사한 바에 의하면 85명의 휴대전화 사용자 중 A회사는 이용자가 45명, B회사는 이용자가 25명, C회사는 이용자가 15명.
# 올해의 조사 결과가 작년의 조사 결과와 동일하다고 할 수 있는지 적합성 검정을 통해 검정할 수 있음.

############################################################결과값(print)#################################################################

# > oc <- c(60, 55, 35)
# > null.p <- c(0.45, 0.30, 0.25)
# > chisq.test(oc, p=null.p)
#
# Chi-squared test for given probabilities
#
# data:  oc
# X-squared = 3.2222, df = 2, p-value = 0.1997

##########################################################################################################################################

chisq.test(oc, p=c(45, 25, 15)/85)

# 검정결과 유의수준 0.05에서 올해의 조사 결과가 작년과 동일하다는 귀무가설 기각할 수 있음.
# 1년동안 시장점유율에서 변화가 있음.

############################################################결과값(print)#################################################################

# > chisq.test(oc, p=c(45, 25, 15)/85)
#
# Chi-squared test for given probabilities
#
# data:  oc
# X-squared = 10.178, df = 2, p-value = 0.006165

##########################################################################################################################################

str(HairEyeColor)

# 다차원의 table객체에 저장된 데이터셋에 대한 적합성 검정을 위해서는 먼저 검정하고자 하는 변수를 추출하여 1차원의 벡터형태로 만듦.
# 표준 패키지에 내장된 HairEyeColor 데이터셋을 이용하여 적합성검정 수행.
# HairEyeColor 데이터셋은 머리 색깔(Hair), 눈 색깔(Eye), 성별(Sex)을 나타내는 3개의 차원으로 구성.

############################################################결과값(print)#################################################################

# > str(HairEyeColor)
# 'table' num [1:4, 1:4, 1:2] 32 53 10 3 11 50 10 30 10 25 ...
# - attr(*, "dimnames")=List of 3
# ..$ Hair: chr [1:4] "Black" "Brown" "Red" "Blond"
# ..$ Eye : chr [1:4] "Brown" "Blue" "Hazel" "Green"
# ..$ Sex : chr [1:2] "Male" "Female"

##########################################################################################################################################

# margin.table()함수를 이용하여 머리 색깔 데이터만 추출.

hairs <- margin.table(HairEyeColor, margin = 1)
hairs

# 한 생리학자는 미국의 인구분포상 갈색 머리는 50%, 검은색 머리는 25%, 금발머리는 15%, 붉은색 머리는 10%라고 주장.
# 앞에서 추출한 머리 색깔 빈도 데이터를 이용하여 이러한 머리 색깔의 분포에 대한 생리학자의 주장이 맞는지 적합성검정 수행.

############################################################결과값(print)#################################################################

# > hairs <- margin.table(HairEyeColor, margin = 1)
# > hairs
# Hair
# Black Brown   Red Blond 
# 108   286    71   127 

##########################################################################################################################################

chisq.test(hairs, p=c(0.25, 0.50, 0.10, 0.15))

# 검정결과 p값이 매우 작으므로 유의수준 0.05에서 귀무가설은 기각.
# 따라서 생리학자가 주장하는 머리 색깔의 분포는 받아들이기 어려움.

############################################################결과값(print)#################################################################

# > chisq.test(hairs, p=c(0.25, 0.50, 0.10, 0.15))
#
# Chi-squared test for given probabilities
#
# data:  hairs
# X-squared = 29.934, df = 3, p-value = 1.425e-06

##########################################################################################################################################

