##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github statistics package에 issue를 남기면 확인

##########################################################################################################################################



##########################################################################################################################################

library(MASS)
smokers <- table(survey$Smoke)
smokers

# MASS 패키지에 포함된 survey 데이터셋의 Smoke변수를 이용하여 적합성 검정 수행.
# table()함수를 이용하여 1차원의 빈도표를 생성.

############################################################결과값(print)#################################################################

# > smokers <- table(survey$Smoke)
# > smokers

# Heavy Never Occas Regul 
# 11   189    19    17 

##########################################################################################################################################

chisq.test(smokers, p=c(0.1, 0.7, 0.10, 0.10))

# 이렇게 추출한 흡연자 빈도 데이터를 이용하여 흡연자 분포에 관한 다양한 가설을 검정할 수 있음.
# 예를 들면 비흡연자가 70% 를 차지하고 3가지 유형의 나머지 흡연자는 각각 10% 씩이라고 알려져 있다면 이러한 가설을 다음과 같이 검정.

# 검정결과를 보면 p값이 매우 작으므로 유의수준 0.05에서 귀무가설을 기각할 수 있음.
# 따라서 흡연자 및 비흡연자의 분포 비율을 알려진 것과 다름.

############################################################결과값(print)#################################################################

# > chisq.test(smokers, p=c(0.1, 0.7, 0.10, 0.10))

# Chi-squared test for given probabilities

# data:  smokers
# X-squared = 12.898, df = 3, p-value = 0.004862

##########################################################################################################################################
