####################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github statistics package에 issue를 남기면 확인

####################################################################################################################################

install.packages("heplots")

library(heplots)

# heplots 패키지에 포함된 Skulls 데이터셋을 이용하여 다변량 분산분석 실행.

####################################################################################################################################

# Skulls 데이터셋은 고대 이집트 왕조시대부터 로마시대에 이르기까지 이집트 지역에서 발굴된 인간의 두개골 크기를 측정한 데이터.
# 이집트 역사를 5개의 시대(epoch)로 구분하고, 각 시대별로 30개씩 두개골을 4 개의 지표로 측정.

# 4개의 지표는 두개골의 폭(mb), 높이(bh), 길이(bl), 그리고 코의 높이(nh)를 나타냄.

str(Skulls)


########################################################결과값(print)###############################################################

# > str(Skulls)
# 'data.frame':	150 obs. of  5 variables:
#  $ epoch: Ord.factor w/ 5 levels "c4000BC"<"c3300BC"<..: 1 1 1 1 1 1 1 1 1 1 ...
# $ mb   : num  131 125 131 119 136 138 139 125 131 134 ...
# $ bh   : num  138 131 132 132 143 137 130 136 134 134 ...
# $ bl   : num  89 92 99 96 100 89 108 93 102 99 ...
# $ nh   : num  49 48 50 44 54 56 48 48 51 51 ...

####################################################################################################################################



####################################################################################################################################
library(dplyr)

sample_n(Skulls, 10)

# 표본의 갯수를 무작위로개 10개 추출.

########################################################결과값(print)###############################################################

# > sample_n(Skulls, 10)
# epoch  mb  bh  bl nh
# 1  c3300BC 133 125  94 46
# 2  c3300BC 131 134  90 53
# 3  c1850BC 136 133  91 49
# 4   cAD150 137 134  93 53
# 5  c4000BC 124 138 101 46
# 6   cAD150 143 120  95 51
# 7   cAD150 138 125  99 51
# 8   c200BC 133 120  91 46
# 9  c1850BC 138 133  91 46
# 10 c4000BC 131 134 102 51


####################################################################################################################################


attach(Skulls)
y <- cbind(mb, bh, bl, nh)
aggregate(y, by=list(epoch), FUN=mean)

# 다변량 분산분석을 통해 두개골의 측정값이 시대에 따라 다른지 검정.
# 두개골의 폭, 높이, 길이.
# 코의 높이는 종속변수이고, 시대는 5개의 범주를 갖는 독립변수.

# 다변량 분산분석을 수행하기 위해 종속변수들을 결합하여 하나의 행렬 형식으로 변환.

# aggregate()함수를 이용하여 다음과 같이 시대별로 두개골 측정값의 평균을 구할 수 있음.

########################################################결과값(print)###############################################################

# > attach(Skulls)
# > y <- cbind(mb, bh, bl, nh)
# > aggregate(y, by=list(epoch), FUN=mean)
# Group.1       mb       bh       bl       nh
# 1 c4000BC 131.3667 133.6000 99.16667 50.53333
# 2 c3300BC 132.3667 132.7000 99.06667 50.23333
# 3 c1850BC 134.4667 133.8000 96.03333 50.56667
# 4  c200BC 135.5000 132.3000 94.53333 51.96667
# 5  cAD150 136.1667 130.3333 93.50000 51.36667

# 측정 지표에 따라 정도의 차이가 있기는 하지만 대체로 두개골 측정값의 평균이 시대별로 다른 듯이 보임을 확인할 수 있음.
# 모집단으로 일반화하기 위해서는 통계적 검정 절차가 필요함.

####################################################################################################################################

# manova()함수를 이용하여 다음과 같이 종속변수값(4가지 유형의 두개골 측정값)의 집단(5개 시대)간 차이에 대한 다변량 분산 분석 실행.

Skulls.manova <- manova(y ~ epoch) 
summary(Skulls.manova)

########################################################결과값(print)###############################################################

# > Skulls.manova <- manova(y ~ epoch) 
# > summary(Skulls.manova)
# Df  Pillai approx F num Df den Df    Pr(>F)    
# epoch       4 0.35331    3.512     16    580 4.675e-06 ***
#  Residuals 145                                             
# ---
#  Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

# 검정결과 p-값이 유의수준 0.05에 비해 매우 작으므로 시대에 따라 두개골 측정값은 다르다고 볼 수 있음.

####################################################################################################################################

# 구체적으로 어느 두개골 측정값에 차이가 존재하는 확인하기 위해서는 다음과 같이 summary.aov()함수를 이용하여 일변량 일원분산분석 수행.

summary.aov(Skulls.manova)

########################################################결과값(print)###############################################################

# > summary.aov(Skulls.manova)
# Response mb :
#  Df  Sum Sq Mean Sq F value    Pr(>F)    
# epoch         4  502.83 125.707  5.9546 0.0001826 ***
#  Residuals   145 3061.07  21.111                      
# ---
#  Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

# Response bh :
#  Df Sum Sq Mean Sq F value  Pr(>F)  
# epoch         4  229.9  57.477  2.4474 0.04897 *
#  Residuals   145 3405.3  23.485                  
# ---
#  Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

# Response bl :
#  Df Sum Sq Mean Sq F value    Pr(>F)    
# epoch         4  803.3 200.823  8.3057 4.636e-06 ***
#  Residuals   145 3506.0  24.179                      
# ---
#  Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

# Response nh :
#  Df Sum Sq Mean Sq F value Pr(>F)
# epoch         4   61.2  15.300   1.507 0.2032
# Residuals   145 1472.1  10.153      

# 유의수준 0.05에서 nh(코의 높이)를 제외한 나머지 두개골 측정값은 시대별로 차이가 있음.
# 시간의 흐름에 따라 두개골 측정값에 차이가 존재하는 것은 이민족의 유입에 의한 혼혈가능성을 나타낸 것일 수도 있음.

####################################################################################################################################