##########################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github statistics package에 issue를 남기면 확인

##########################################################################################################################################



##########################################################################################################################################

library(MASS)
str(cats)

# cats 데이터셋을 이용한 상관분석
# 성별(Sex), 몸무게(Bwt), 심장무게(Hwt)
# 몸무게는 킬로그램(kg), 심장무게는 그램(g)단위.


############################################################결과값(print)#################################################################

# > library(MASS)
#> str(cats)
# 'data.frame':	144 obs. of  3 variables:
#  $ Sex: Factor w/ 2 levels "F","M": 1 1 1 1 1 1 1 1 1 1 ...
# $ Bwt: num  2 2 2 2.1 2.1 2.1 2.1 2.1 2.1 2.1 ...
# $ Hwt: num  7 7.4 9.5 7.2 7.3 7.6 8.1 8.2 8.3 8.5 ...


##########################################################################################################################################

plot(cats$Hwt ~ cats$Bwt, col="forestgreen", pch=19, xlab="Body Weight (kg)", 
     ylab = "Heart Weight(g)", main="Body Weight and Heart Weight of Cats")

# (산점도 / Scatter Plot)= 고양이 몸무게와 심장무게 간에는 정(+)의 선형관계가 존재.

# 산점도를 이용하면 변수 간의 관계 패턴을 쉽게 이해할 수 있음.
# 하지만 선형관계의 강도를 객관적으로 파악할 수 없음.

# 두 변수 간의 선형관계의 강도는 상관계수(Correlation coefficient)로 측정.
# 상관계수는 -1에서 +1 사이의 값을 가지며, 0일 경우에는 두 변수 간의 선형관계가 없다는 것을 뜻함.
# -의 상관계수는 부의 선형관계(negative linear relationship)를 나타내며, +의 상관계수는 정의 선형관계(positive linear relationship).

# -1은 완전한 부의 선형관계, +1은 완전한 정의 선형관계.

# 만일 두 변수 간의 상관계수가 -1 또는 +1이라면 하나의 변수로부터 나머지 하나의 변수를 완벽하게 예측할 수 있다는 것을 의미.

##########################################################################################################################################

cor(cats$Bwt, cats$Hwt)

with(cats, cor(Bwt, Hwt))

# cor() 함수의 method인수에는 상관계수 종류를 지정할 수 있음.
# 기본값은 method="pearson"으로서 피어슨 상관계수(Pearson correlation coefficient)를 계산.

# 서열척도로 측정된 데이터의 등위상관계수(rank-order correlation coefficient)를 계산하기 위해서는 
# method="spearman"(스피어만 상관계수, spearman correlation coefficient)이나
# method="kendall"(켄달 상관계수, Kendall correlation coefficient)을 지정.

# 데이터셋에 결측값이 포함되어 있을 때는 use인수를 추가로 지정하여 상관계수 계산방법을 결정할 수 있음.
# 기본값은 use="everything"으로서 결측값이 포함되어 있을 경우 NA가 출력.

# use="complete.obs"를 지정하면 하나라도 결측값을 포함하고 있는 케이스는 상관계수 계산 시 제외함.

# 반면에 use="pairwise.complete.obs"를 지정하면 분석에 사용되는 변수에 대해서만 결측값이 존재할 때 해당 케이스를 분석에서 제외.

# 따라서 상관계수는 정규성의 가정을 필요로 함. 정규성의 가정을 충족하지 못할 때는 데이터 값을 순위(Rank)로 대체하여 상관계수를 계산.

# 스피어만 상관계수는 정규성 가정을 충족하지 못하는 서열척도의 데이터를 바탕으로 계산된다.
# 스피어만 상관계수는 순위 데이터를 바탕으로 계산되기 때문에 이상점에 덜 민감함.


############################################################결과값(print)#################################################################

# > cor(cats$Bwt, cats$Hwt)
# [1] 0.8041274
# > 
#  > with(cats, cor(Bwt, Hwt))
# [1] 0.8041274

##########################################################################################################################################

with(cats, cor.test(Bwt, Hwt))

# 상관계수에 대한 유의성은 cor.test()함수를 이용하여 검정.
# 모집단에서의 상관계수가 0이라는 귀무가설을을 검정.

# 검정결과 p값이 유의수준 0.05에 비해 매우 작으므로 귀무가설 기각.
# 고양이의 몸무게와 심장무게 간에는 상관관계 존재.

# cor.test()함수에는 alternative="greater"나 alternative="less"를 지정하여 단측검정 수행.
# conf.level 인수에 신뢰구간의 신뢰수준을 지정.

############################################################결과값(print)#################################################################

# > with(cats, cor.test(Bwt, Hwt))

# Pearson's product-moment correlation

# data:  Bwt and Hwt
# t = 16.119, df = 142, p-value < 2.2e-16
# alternative hypothesis: true correlation is not equal to 0
# 95 percent confidence interval:
# 0.7375682 0.8552122
# sample estimates:
#      cor 
# 0.8041274 

##########################################################################################################################################

with(cats, cor.test(Bwt, Hwt, alternative = "greater", conf.level = 0.99))



############################################################결과값(print)#################################################################

# > with(cats, cor.test(Bwt, Hwt, alternative = "greater", conf.level = 0.99))

# Pearson's product-moment correlation

# data:  Bwt and Hwt
# t = 16.119, df = 142, p-value < 2.2e-16
# alternative hypothesis: true correlation is greater than 0
# 99 percent confidence interval:
# 0.7231755 1.0000000
# sample estimates:
#      cor 
# 0.8041274 

##########################################################################################################################################

with(cats, cor.test(~ Bwt + Hwt))

############################################################결과값(print)#################################################################

# > with(cats, cor.test(~ Bwt + Hwt))

# Pearson's product-moment correlation

# data:  Bwt and Hwt
# t = 16.119, df = 142, p-value < 2.2e-16
# alternative hypothesis: true correlation is not equal to 0
# 95 percent confidence interval:
# 0.7375682 0.8552122
# sample estimates:
#      cor 
# 0.8041274 

##########################################################################################################################################

cor.test(~ Bwt + Hwt, data = cats)

# cor.test()함수는 포뮬러 형식을 지원함.
# 다음과 같이 ~ 뒤에 검정하려는 두 변수를 + 연산자를 이용하여 지정.
# 함수를 실행하면 앞에서와 동일한 검정 결과를 얻을 수 있음.

############################################################결과값(print)#################################################################

# > cor.test(~ Bwt + Hwt, data = cats)

# Pearson's product-moment correlation

# data:  Bwt and Hwt
# t = 16.119, df = 142, p-value < 2.2e-16
# alternative hypothesis: true correlation is not equal to 0
# 95 percent confidence interval:
# 0.7375682 0.8552122
# sample estimates:
#      cor 
# 0.8041274 

##########################################################################################################################################

cor.test(~ Bwt + Hwt, data = cats, subset = (Sex=="F"))

# 포뮬러 형식을 사용하면 서브셋별로 함수를 적용할 수 있는 장점이 있음.
# 예를 들어, 암컷 고양이에 대해서만 상관계수의 유의성을 검정하려면 다음과 같이 subset 인수에 추출하고자 하는 서브셋 조건(Sex=="F")을 지정.

############################################################결과값(print)#################################################################

# > cor.test(~ Bwt + Hwt, data = cats, subset = (Sex=="F"))

# Pearson's product-moment correlation

# data:  Bwt and Hwt
# t = 4.2152, df = 45, p-value = 0.0001186
# alternative hypothesis: true correlation is not equal to 0
# 95 percent confidence interval:
# 0.2890452 0.7106399
# sample estimates:
#      cor 
# 0.5320497 

##########################################################################################################################################
