
####################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github statistic package에 issue를 남기면 확인

####################################################################################################################################

gender <- factor(c("MALE", "FEMALE", "MALE"))

gender


########################################################결과값(print)###############################################################


# [1] MALE   FEMALE MALE  
# Levels: FEMALE MALE

####################################################################################################################################

blood <- factor(c("O","AB", "B"), levels = c("A", "B", "AB", "O"))

blood

#factor(팩터)를 생성할 때 원시 데이터에는 아직 존재하지 않는 추가 레벨을 더할 수 있음.
#혈액형을 위한 factor를 생성

#blood factor를 정의할 때 levels 파라미터를 사용해 4 종류의 혈액형을 지정함.
#결과적으로는 데이터는 O, AB, A형만 포함하고 있지만, 4 가지의 모든 혈액형 종류가 blood factor에 저장돼 있다는 것을 출력에서 보여줌.

#추가 레벨을 저장함으로써 앞으로 다른 혈액형을 갖는 환자 데이터를 추가할 수 있음.
#혈액형 표를 생성하면 초기 데이터에 해당 혈액형이 없어도 B형이라는 혈액형이 존재한다는 것을 알 수 있음.


########################################################결과값(print)###############################################################


# [1] O  AB B 
# Levels: A B AB O

####################################################################################################################################

symptoms <- factor(c("SEVERE", "MILD", "MODERATE", "EXTREME"),
                   levels = c("MILD", "MODERATE", "SEVERE", "EXTREME"),
                   ordered = TRUE)

symptoms

# 팩터 데이터 구조는 명목 변수(Nominal Variable)의 범주 순서 정보를 가질 수 있어 서열(ordinal) 데이터를 저장하는 편리한 방법도 제공.
# 예를 들면 MILD(경증), MODERATE(중등증), SEVERE(중증), EXTREME(극심) 순으로 증가하는 심각도 수준으로 코드화된 환자증상 심각도 데이터.

# 순위 데이터가 있음을 나타내려면 팩터의 levels를 원하는 순서로 낮은 값에서 높은 값까지 오름차 순으로 열거해 제공함.
# ordered 파라미터를 TRUE로 설정.

# 이제 생성된 symptoms 팩터는 요구했던 순서 정보를 포함.
# 이전 팩터와는 달리 이 팩터의 levels 값은 < 기호로 구분돼 MILD에서 SEVERE까지 일련의 순서가 있음.

########################################################결과값(print)###############################################################

#[1] SEVERE   MILD     MODERATE EXTREME 
#Levels: MILD < MODERATE < SEVERE < EXTREME

####################################################################################################################################

symptoms > "MODERATE"

# 순서 팩터의 유용한 기능 중 하나는 논리 테스트가 예상대로 작동한다는 것.
# 예를 들면 환자의 증상이 중등증(MODERATE)보다 큰지 테스트 가능.

# 순위 데이터를 모델링하는 머신러닝 알고리즘은 순서 팩터를 기대하기 때문에 그에 맞추어 데이터를 코딩해야 함.

########################################################결과값(print)###############################################################

# [1]  TRUE FALSE FALSE  TRUE

####################################################################################################################################