
####################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github statistic package에 issue를 남기면 확인

####################################################################################################################################

###리스트(List)

# List는 항목의 순서 집합을 저장하는 데 사용된다는 점에서 벡터와 매우 유사한 데이터 구조임.
# 하지만 벡터(vector)는 모든 항목이 같은 타입이어야 한다는 단점이 있음.
# 반면에 리스트는 다양한 타입의 입출력 데이터와 머신러닝 모델의 설정 파라미터 집합을 저장하는 데 자주 사용됨.

# 6개의 벡터에 저장된 3명의 환자 데이터로 구축된 의료 환자 데이터셋을 고려.
# 첫번째 환자의 데이터를 보여주려면 아래와 같이 5개 명령 입력.

subject_name[1]

temperature[1]

flu_status[1]

gender[1]

blood[1]

symptoms[1]

########################################################결과값(print)###############################################################

# > subject_name[1]
# [1] "John Doe"

# > temperature[1]
# [1] 98.1

#> flu_status[1]
# [1] FALSE

# [1] MALE
# Levels: FEMALE MALE

# [1] O
# Levels: A B AB O

# [1] SEVERE
# Levels: MILD < MODERATE < SEVERE < EXTREME


####################################################################################################################################

# 미래에 환자의 데이터를 다시 조사한다고 하면 위의 명령을 다시 입력하는 대신 List를 사용하면 모든 값을 하나의 객체로 그룹화
# 추후 반복적으로 사용 가능.

# c()함수로 벡터를 생성하는 것처럼 list()함수로 리스트를 생성할 수 있음.
# 차이점이라고 하면 리스트를 구성할 때 열의 각 구성요소에는 이름이 주어져야 함.

# 이름이 반드시 필요하지는 않지만, 이를 통하여 나중에 리스트 값에 접근할 때 숫자로 된 위치가 아닌 이름으로 접근할 수 있음.
# 첫 환자의 데이터 전체에 대해 이름이 있는 구성 요소로 이뤄진 리스트를 생성하려면 다음과 같이 입력.

subject1 <- list(fullname = subject_name[1],
                 temperature= temperature[1],
                 flu_status= flu_status[1],
                 gender= gender[1],
                 blood= blood[1],
                 symptoms= symptoms[1])


########################################################결과값(print)###############################################################

# > subject1 <- list(fullname = subject_name[1],
#                   +                  temperature= temperature[1],
#                   +                  flu_status= flu_status[1],
#                   +                  gender= gender[1],
#                   +                  blood= blood[1],
#                   +                  symptoms= symptoms[1])


####################################################################################################################################

subject1$fullname

subject1$temperature

subject1$flu_status

subject1$gender

subject1$blood

subject1$symptoms


########################################################결과값(print)###############################################################

# > subject1$fullname
# [1] "John Doe"

# > subject1$temperature
# [1] 98.1

# > subject1$flu_status
# [1] FALSE

# > subject1$gender
# [1] MALE

# Levels: FEMALE MALE
# > subject1$symptoms

# [1] SEVERE
# Levels: MILD < MODERATE < SEVERE < EXTREME

####################################################################################################################################

subject1[2]$temperature


# 환자의 데이터는 subject1 리스트에 수집.
# 이전 명령에서 지정된 이름으로 값이 레이블된 점 확인.
# 리스트는 벡터처럼 순서를 지키므로 구성 요소도 temperature 값에서 본 것처럼 수치로 된 위치 값으로 접근.

########################################################결과값(print)###############################################################

# > subject1[2]$temperature
# [1] 98.1

####################################################################################################################################

subject1[[2]]

# 리스트에 벡터 스타일 연산자를 적용한 결과는 새로운 리스트 객체로, 원래 리스트의 부분집합임.
# 예를 들어 앞으 코드는 단일 temperature 구성 요소를 갖는 리스트를 반환함.
# 기본 데이터 타입을 갖는 하나의 리스트 항목을 반환하려면 리스트의 구성 요소를 선택할 때 이중 괄호 [[ ]]를 사용.
# 아래의 결과값은 다음의 길이ㅏ 1인 수치 벡터를 반환함.

########################################################결과값(print)###############################################################

# > subject1[[2]]
# [1] 98.1

####################################################################################################################################

subject1$temperature

# 명확하게 하고자 리스트 구성 요소에 접근할 때 $와 리스트 구성 요소 이름을 다음에 보는 것처럼 리스트 이름에 붙여 접근.

# 리스트 값에 이름으로 접근하면 나중에 리스트 항목의 순서가 바뀌어도 정확한 항목이 검색 가능.

########################################################결과값(print)###############################################################

# > subject1$temperature
# [1] 98.1

####################################################################################################################################

subject1[c("temperature", "flu_status")]$temperature

subject1[c("temperature", "flu_status")]$flu_status

# 이름 벡터를 명시해 리스트의 여러 항목을 얻을 수도 있음.
# temperature와 flu_status 구성 요소로 된 subject1 리스트의 부분집합을 반환함.

# 전체 데이터셋을 리스트와 리스트의 리스트를 사용해 구출할 수도 있음.
# 예를 들자면 subject2와 subject3 리스트를 생성한 이것들을 pt_data란 이름의 한 리스트 객체로 묶는 것도 고려할 수 있음.

########################################################결과값(print)###############################################################

# > subject1[c("temperature", "flu_status")]$temperature
# [1] 98.1

# > subject1[c("temperature", "flu_status")]$flu_status
# [1] FALSE

####################################################################################################################################

