####################################################################################################################################

#(주의) ->  순차적으로 코드를 실행하는 것을 권함!

#에러 발생 시 github statistic package에 issue를 남기면 확인

####################################################################################################################################

### 행렬
## Matrixes -----

# R은 데이터 프레임 외에 표 형태로 값을 저장하는 다른 데이터 구조 제공.
# 행렬은 데이터의 행과 열을 갖는 2차원 표를 나타내는 데이터 구조.
# R 행렬은 벡터처럼 동일한 형식의 데이터만 가질 수 있으며, 대개 수학연산에서 자주 사용되므로 일반적으로 수치 데이터만 저장.

# 행렬을 생성하려면 행의 개수(nrow) 또는 열의 개수(ncol)를 명시하는 파라미터와 함께 데이터 벡처를 간단히 matrix()함수에 제공.

# 예를 들어 1에서 4까지의 숫자를 저장하는 2*2 행렬을 생성하려면 nrow 파라미터를 사용해 데이터가 2개의 행으로 분리되도록 요청.

# create a 2x2 matrix
m <- matrix(c(1, 2, 3, 4), nrow = 2)
m

############################################################결과값(print)###########################################################

# > m <- matrix(c(1, 2, 3, 4), nrow = 2)
# > m
# [,1] [,2]
# [1,]    1    3
# [2,]    2    4

####################################################################################################################################

# ncol=2를 사용해 생성한 행렬과 동일

# equivalent to the above
m <- matrix(c(1, 2, 3, 4), ncol = 2)
m

############################################################결과값(print)###########################################################

# > m <- matrix(c(1, 2, 3, 4), ncol = 2)
# > m
# [,1] [,2]
# [1,]    1    3
# [2,]    2    4

####################################################################################################################################

# R이 먼저 행렬의 첫 번째 열을 로드한 후 2번째 열을 로드함.
# R이 행렬을 로드하는 기본 방법은 열 우선 순(column-major-order)

# 기본 설정을 바꿔 행렬을 행 단위로 로드하려면 행렬 생성 시에 byrow = TRUE로 파라미터를 설정.

# 6개의 값으로 2개의 행을 요청하면 3개의 열을 갖는 행렬이 생성. 

# create a 2x3 matrix
m <- matrix(c(1, 2, 3, 4, 5, 6), nrow = 2)
m

#  2개의 열을 요청하면 3개의 행을 갖는 행렬이 생성.

# create a 3x2 matrix
m <- matrix(c(1, 2, 3, 4, 5, 6), ncol = 2)
m

############################################################결과값(print)###########################################################

# > m <- matrix(c(1, 2, 3, 4, 5, 6), nrow = 2)
# > m
# [,1] [,2] [,3]
# [1,]    1    3    5
# [2,]    2    4    6

# > m <- matrix(c(1, 2, 3, 4, 5, 6), ncol = 2)
# > m
# [,1] [,2]
# [1,]    1    4
# [2,]    2    5
# [3,]    3    6

####################################################################################################################################

# 데이터 프레임처럼 행렬 값도 [row, column] 처럼 표기해 추출.
# 예를 들어 m[1,1]은 값 1을 반환하지만, m[3,2]를 행렬 m에서 6을 추출.
# 추가적으로 전체 행이나 열도 요청.

# extract values from matrixes
m[1, 1]
m[3, 2]

# extract rows
m[1, ]

# extract columns
m[, 1]

############################################################결과값(print)###########################################################

# > # extract values from matrixes

#  > m[1, 1]
# [1] 1

# > m[3, 2]
# [1] 6
# > 

#  > # extract rows

#  > m[1, ]
# [1] 1 4
# > 

#  > # extract columns

#  > m[, 1]
# [1] 1 2 3


####################################################################################################################################
